MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMV71N21A/mcu.h
  PERIPH_COUNT_IRQn        = 69  /**< Number of peripheral IDs */
} IRQn_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset  */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted  */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault     */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match  */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction  */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor                        */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service  */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer                    */


  /* Peripheral handlers */
  void* pfnSUPC_Handler;                         /* 0   SAMV71N21 Supply Controller (SUPC) */
  void* pfnRSTC_Handler;                         /* 1   SAMV71N21 Reset Controller (RSTC) */
  void* pfnRTC_Handler;                          /* 2   SAMV71N21 Real-time Clock (RTC) */
  void* pfnRTT_Handler;                          /* 3   SAMV71N21 Real-time Timer (RTT) */
  void* pfnWDT_Handler;                          /* 4   SAMV71N21 Watchdog Timer (WDT) */
  void* pfnPMC_Handler;                          /* 5   SAMV71N21 Power Management Controller (PMC) */
  void* pfnEFC_Handler;                          /* 6   SAMV71N21 Embedded Flash Controller (EFC) */
  void* pfnUART0_Handler;                        /* 7   SAMV71N21 Universal Asynchronous Receiver Transmitter (UART0) */
  void* pfnUART1_Handler;                        /* 8   SAMV71N21 Universal Asynchronous Receiver Transmitter (UART1) */
  void* pvReserved9;
  void* pfnPIOA_Handler;                         /* 10  SAMV71N21 Parallel Input/Output Controller (PIOA) */
  void* pfnPIOB_Handler;                         /* 11  SAMV71N21 Parallel Input/Output Controller (PIOB) */
  void* pvReserved12;
  void* pfnUSART0_Handler;                       /* 13  SAMV71N21 Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  void* pfnUSART1_Handler;                       /* 14  SAMV71N21 Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  void* pfnUSART2_Handler;                       /* 15  SAMV71N21 Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  void* pfnPIOD_Handler;                         /* 16  SAMV71N21 Parallel Input/Output Controller (PIOD) */
  void* pvReserved17;
  void* pfnHSMCI_Handler;                        /* 18  SAMV71N21 High Speed MultiMedia Card Interface (HSMCI) */
  void* pfnTWIHS0_Handler;                       /* 19  SAMV71N21 Two-wire Interface High Speed (TWIHS0) */
  void* pfnTWIHS1_Handler;                       /* 20  SAMV71N21 Two-wire Interface High Speed (TWIHS1) */
  void* pfnSPI0_Handler;                         /* 21  SAMV71N21 Serial Peripheral Interface (SPI0) */
  void* pfnSSC_Handler;                          /* 22  SAMV71N21 Synchronous Serial Controller (SSC) */
  void* pfnTC0_Handler;                          /* 23  SAMV71N21 Timer Counter (TC0)  */
  void* pfnTC1_Handler;                          /* 24  SAMV71N21 Timer Counter (TC0)  */
  void* pfnTC2_Handler;                          /* 25  SAMV71N21 Timer Counter (TC0)  */
  void* pfnTC3_Handler;                          /* 26  SAMV71N21 Timer Counter (TC1)  */
  void* pfnTC4_Handler;                          /* 27  SAMV71N21 Timer Counter (TC1)  */
  void* pfnTC5_Handler;                          /* 28  SAMV71N21 Timer Counter (TC1)  */
  void* pfnAFEC0_Handler;                        /* 29  SAMV71N21 Analog Front-End Controller (AFEC0) */
  void* pvReserved30;
  void* pfnPWM0_Handler;                         /* 31  SAMV71N21 Pulse Width Modulation Controller (PWM0) */
  void* pfnICM_Handler;                          /* 32  SAMV71N21 Integrity Check Monitor (ICM) */
  void* pfnACC_Handler;                          /* 33  SAMV71N21 Analog Comparator Controller (ACC) */
  void* pfnUSBHS_Handler;                        /* 34  SAMV71N21 USB High-Speed Interface (USBHS) */
  void* pfnMCAN0_INT0_Handler;                   /* 35  SAMV71N21 Controller Area Network (MCAN0) */
  void* pfnMCAN0_INT1_Handler;                   /* 36  SAMV71N21 Controller Area Network (MCAN0) */
  void* pfnMCAN1_INT0_Handler;                   /* 37  SAMV71N21 Controller Area Network (MCAN1) */
  void* pfnMCAN1_INT1_Handler;                   /* 38  SAMV71N21 Controller Area Network (MCAN1) */
  void* pfnGMAC_Handler;                         /* 39  SAMV71N21 Gigabit Ethernet MAC (GMAC) */
  void* pfnAFEC1_Handler;                        /* 40  SAMV71N21 Analog Front-End Controller (AFEC1) */
  void* pfnTWIHS2_Handler;                       /* 41  SAMV71N21 Two-wire Interface High Speed (TWIHS2) */
  void* pvReserved42;
  void* pfnQSPI_Handler;                         /* 43  SAMV71N21 Quad Serial Peripheral Interface (QSPI) */
  void* pfnUART2_Handler;                        /* 44  SAMV71N21 Universal Asynchronous Receiver Transmitter (UART2) */
  void* pfnUART3_Handler;                        /* 45  SAMV71N21 Universal Asynchronous Receiver Transmitter (UART3) */
  void* pfnUART4_Handler;                        /* 46  SAMV71N21 Universal Asynchronous Receiver Transmitter (UART4) */
  void* pfnTC6_Handler;                          /* 47  SAMV71N21 Timer Counter (TC2)  */
  void* pfnTC7_Handler;                          /* 48  SAMV71N21 Timer Counter (TC2)  */
  void* pfnTC8_Handler;                          /* 49  SAMV71N21 Timer Counter (TC2)  */
  void* pfnTC9_Handler;                          /* 50  SAMV71N21 Timer Counter (TC3)  */
  void* pfnTC10_Handler;                         /* 51  SAMV71N21 Timer Counter (TC3)  */
  void* pfnTC11_Handler;                         /* 52  SAMV71N21 Timer Counter (TC3)  */
  void* pfnMLB_Handler;                          /* 53  SAMV71N21 MediaLB (MLB)        */
  void* pvReserved54;
  void* pvReserved55;
  void* pfnAES_Handler;                          /* 56  SAMV71N21 Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /* 57  SAMV71N21 True Random Number Generator (TRNG) */
  void* pfnXDMAC_Handler;                        /* 58  SAMV71N21 Extensible DMA Controller (XDMAC) */
  void* pfnISI_Handler;                          /* 59  SAMV71N21 Image Sensor Interface (ISI) */
  void* pfnPWM1_Handler;                         /* 60  SAMV71N21 Pulse Width Modulation Controller (PWM1) */
  void* pfnFPU_Handler;                          /* 61  SAMV71N21 Floating Point Unit (FPU) */
  void* pvReserved62;
  void* pfnRSWDT_Handler;                        /* 63  SAMV71N21 Reinforced Safety Watchdog Timer (RSWDT) */
  void* pvReserved64;
  void* pvReserved65;
  void* pfnGMAC_Q1_Handler;                      /* 66  SAMV71N21 Gigabit Ethernet MAC (GMAC) */
  void* pfnGMAC_Q2_Handler;                      /* 67  SAMV71N21 Gigabit Ethernet MAC (GMAC) */
  void* pfnIXC_Handler;                          /* 68  SAMV71N21 Floating Point Unit (FPU) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF */
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF */
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF */
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF */

